/*
 * ============================================================================
 * 
 *              LCD1602 液晶显示模块
 *   思路分析：
 *      确定显示位置  32个空格     8bit控制(2^5 = 32) 一个字节 最高位控制行 如：0x01第1行第2个 0x40第2行第1个
 *      确定显示内容  A,B,C,D…     8bit控制 参考LCD1602字库表
 *   管脚说明：
 *       1：VSS接地
 *       2：VDD接5V正电源
 *       3：VL对比度调节位，过高有鬼影，可接10K电位器
 *       4：RS寄存器，高电平数据，低电平指令
 *       5：R/W读写选择位 高电平写，低电平读
 *       6：E使能信号
 *       7-14：数据/命令位
 *  
 * ============================================================================
 */

#include "LCD1602.h"

/*
 * ============================================================================ 
 * 
 *          函数名: LCD1602_ready
 *          说  明：等待LCD1602结束忙碌状态
 *          输  入：无
 *          输  出：无
 * 
 * ============================================================================
 */
void LCD1602_ready(void)
{
    DB = 0xFF;
    RS = 0;
    RW = 1;
    EN = 0;
    _nop_();
    EN = 1;
    while (DB & 0x80)
        ;
}

/*
 * ============================================================================ 
 * 
 *          函数名：write_cmd
 *          说  明：发送指令cmd确定显示位置
 *          输  入：cmd指令
 *          输  出：无
 * 
 * ============================================================================
 */
void write_cmd(unsigned char cmd)
{
    LCD1602_ready();
    RS = 0;
    RW = 0;
    DB = cmd;
    EN = 0;
    _nop_();
    EN = 1;
    _nop_();
    _nop_();
    EN = 0;
}

/*
 * ============================================================================
 * 
 *          函数名：write_dat
 *          说  明：发送显示数据
 *          输  入：dis_dat数据
 *          输  出：无
 * 
 * ============================================================================
 */
void write_dat(unsigned char dis_dat)
{
    RS = 1;
    RW = 0;
    DB = dis_dat;
    EN = 0;
    _nop_();
    EN = 1;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_(); //防止频繁写入冲刷数据
    EN = 0;
}

/*
 * ============================================================================ 
 * 
 *          函数名: LCD1602_init
 *          说  明：LCD1602模块初始化
 *          输  入：无
 *          输  出：无
 * 
 * ============================================================================
 */
void LCD1602_init()
{
    write_cmd(LCD1602_SET);
    write_cmd(LCD1602_ON);
    write_cmd(LCD1602_CLE);
    write_cmd(LCD1602_MV);
}

/*
 * ============================================================================ 
 * 
 *          函数名: set_postion
 *          说  明：设置在指定位置显示，line行row列，返回位置地址值
 *          输  入：line,row
 *          输  出：位置pos地址值
 * 
 * ============================================================================
 */
unsigned char set_postion(unsigned char line, unsigned char row)
{
    unsigned char pos;
    if (line == 0)
        pos = 0x80 + row;
    if (line == 1)
        pos = 0xc0 + row;
    return pos;
}
/*
 * ============================================================================ 
 * 
 *          函数名: dis_char
 *          说  明：字符dat在指定位置显示，line行row列
 *          输  入：line,row,dat
 *          输  出：无
 * 
 * ============================================================================
 */
void dis_char(unsigned char line, unsigned char row, unsigned char dis_dat)
{
    write_cmd(set_postion(line, row));
    write_dat(dis_dat);
}

/*
 * ============================================================================ 
 * 
 *          函数名: dis_string
 *          说  明：字符串在指定位置开始显示
 *          输  入：line,row,*p
 *          输  出：无
 * 
 * ============================================================================
 */
void dis_string(unsigned char line, unsigned char row, unsigned char *p)
{
    write_cmd(set_postion(line, row));
    while (1)
    {
        if (*p == '\0')
            break;
        write_dat(*p);
        p++;
    }
}
