/*******************************************************************************
 * Copyleft (c) 2020 SaltyKid 1035183478@qq.com
 *
 * 版权描述信息略
 *
 * @file    LCD1602.c
 * @author  SaltyKid
 * @version 0.0.2
 * @date    2020-10-28
 * @license GNU General Public License (GPL)
 * @brief   LCD1602 液晶显示模块C51驱动源码
 *          主要功能：
 *                 - LCD1602模块初始化
 *                 - 在指定位置显示字符
 *                 - 在指定位置显示字符串
 *  
 * -----------------------------------------------------------------------------
 * Change History:
 *   <Date>      |  <Version>  |  <Author>  |  <Description>
 *   2020-08-27  |  v0.0.1     |  SaltyKid  |  Create file
 *   2020-10-28  |  v0.0.2     |  SaltyKid  |  Alter file
 * -----------------------------------------------------------------------------
 ******************************************************************************/

/*=============================== 头文件包含 =================================*/
#include "LCD1602.h"

/*================================ 接口函数 ==================================*/

/*******************************************************************************
 * @brief  LCD1602模块初始化
 * @param  None
 * @return None
 ******************************************************************************/
void LCD1602_init()
{
    write_cmd(LCD1602_SET);
    write_cmd(LCD1602_ON);
    write_cmd(LCD1602_CLE);
    write_cmd(LCD1602_MV);
}

/*******************************************************************************
 * @brief  在指定位置显示字符dat
 * @param  line: 行
 * @param  row: 列
 * @param  dis_dat: 要显示的字符
 * @return None
 ******************************************************************************/
void dis_char(unsigned char line, unsigned char row, unsigned char dis_dat)
{
    write_cmd(set_postion(line, row));
    write_dat(dis_dat);
}

/*******************************************************************************
 * @brief  在指定位置开始显示字符串
 * @param  line: 行
 * @param  row: 列
 * @param  *p: 要显示的字符串
 * @return None
 ******************************************************************************/
void dis_string(unsigned char line, unsigned char row, unsigned char *p)
{
    write_cmd(set_postion(line, row));
    while (1)
    {
        if (*p == '\0')              
            break;                     //< 字符串结束 跳出循环
        write_dat(*p);
        p++;
    }
}
/*******************************************************************************
 * @brief  等待LCD1602结束忙碌状态
 * @param  None
 * @return None
 ******************************************************************************/
void LCD1602_ready(void)
{
    DB = 0xFF;
    /*! 
     *    读状态 RS=0 RW=1 EN=1 
     *    返回 1字节 状态字 
     *    高位 1 忙 
     */
    RS = 0;
    RW = 1;

    EN = 0;
    _nop_();                  //< 延时要求高于30ns 这里直接延时1us
    EN = 1;

    while (DB & 0x80)         //< 忙 等待
        ;
}

/*******************************************************************************
 * @brief  发送指令cmd
 * @param  cmd: 指令
 * @return None
 ******************************************************************************/
void write_cmd(unsigned char cmd)
{
    LCD1602_ready();          //< 判忙
    /*! 
     *    写指令 RS=0 RW=0 DB=cmd EN=1
     *    这里提前准备好命令cmd，再开使能
     */
    RS = 0;
    RW = 0;
    DB = cmd;

    EN = 0;
    _nop_();                  //< 延时要求高于30ns 这里直接延时1us
    EN = 1;
    _nop_();
    _nop_();                  //< 延时要求高于45ns 硬件调试时延时1us会出错，这里直接延时2us
    EN = 0;
}

/*******************************************************************************
 * @brief  发送显示数据
 * @param  dis_dat: 显示的数据
 * @return None
 ******************************************************************************/
void write_dat(unsigned char dis_dat)
{
    /*! 
     *    写指令 RS=0 RW=0 DB=cmd EN=1
     *    这里提前准备好显示数据dis_dat，再开使能
     */
    RS = 1;
    RW = 0;
    DB = dis_dat;

    EN = 0;
    _nop_();
    EN = 1;
    for (volatile unsigned char i = 0; i < 10; i++)
    {
        _nop_();                              //<  硬件调试发现频繁写入会冲刷数据，这里直接延时10us
    }
    EN = 0;
}

/*******************************************************************************
 * @brief  设置在指定位置显示，line行row列，返回位置地址值
 * @param  line: 行
 * @param   row: 列
 * @return 位置地址值
 ******************************************************************************/
unsigned char set_postion(unsigned char line, unsigned char row)
{
    unsigned char pos;
    if (line == 0)
        pos = 0x80 + row;
    if (line == 1)
        pos = 0xc0 + row;
    return pos;
}
