#include "DHT11.h"
#include <intrins.h>

/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_Ready
 *          说  明：检测DHT11是否正常响应,响应返回1，不响应返回-1;
 *          输  入：无
 *          输  出：1或-1
 * 
 * ============================================================================
 */
char DHT11_Ready(void)
{
    dht = 1;
    DHT11_delay10us();
    dht = 0;
    DHT11_delay_ms(20);
    dht = 1;
    DHT11_delay10us(); //主机拉高40us
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us();
	DHT11_delay10us();
	_nop_();
    if (dht == 0) //检测到响应信号
    {
        while (!dht)
            ;
        return 1;
    }
    else //未检测到响应信号
    {
        return -1;
    }
}

/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_Start
 *          说  明：DHT11发送开始信号
 *          输  入：无
 *          输  出：无
 * 
 * ============================================================================
 */
void DHT11_Start(void)
{
    dht = 1;
    DHT11_delay10us();
    dht = 0;
    DHT11_delay_ms(20);
    dht = 1;
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us(); //主机拉高40us
	_nop_();
}

/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_Over
 *          说  明：DHT11结束通信
 *          输  入：无
 *          输  出：无
 * 
 * ============================================================================
 */
void DHT11_Over(void)
{
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us();
    DHT11_delay10us(); //延迟50us后拉高
    dht = 1;
}
/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_ReadBit
 *          说  明：读取DHT11发送的数据，接收一个字节
 *          输  入：无
 *          输  出：一个字节，bitRead
 * 
 * ============================================================================
 */
char DHT11_ReadBit(void)
{
    unsigned char i, bitRead = 0;
    for (i = 0; i < 8; i++)
    {
        while (!dht)
            ;
        DHT11_delay10us();
        DHT11_delay10us();
        DHT11_delay10us();
        DHT11_delay10us();
        DHT11_delay10us();
        bitRead <<= 1;
        if (dht == 1)
            bitRead |= 1; //读到 1,保存接收的数据1，读到0，已经移位补0无需其它操作
        while (dht)
            ;
    }
    return bitRead;
}

/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_Read()
 *          说  明：完整的一次数据采集
 *          输  入：一个p数组指针
 *          输  出：
 * 
 * ============================================================================
 */
void DHT11_Read(unsigned char *p)
{
    unsigned char temp[5] = {0};
    DHT11_Start();
    if (!dht)
    {
        while (!dht);
		while(dht);
        temp[0] = DHT11_ReadBit();
        temp[1] = DHT11_ReadBit();
        temp[2] = DHT11_ReadBit();
        temp[3] = DHT11_ReadBit();
        temp[4] = DHT11_ReadBit();
        DHT11_Over();
        if ((temp[0] + temp[1] + temp[2] + temp[3]) == temp[4])
        {
            p[0] = temp[0];
            p[1] = temp[1];
            p[2] = temp[2];
            p[3] = temp[3];
            p[4] = temp[4];
        }
    }
}

 /*
 * ============================================================================ 
 * 
 * 	以下为延时函数
 *
 * ============================================================================
 */


/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_delay10us
 *          说  明：10us延时。\
 *                主函数调用DDHT11_delay10us()时,\
 *                先执行一个LCALL指令(2 μs),\
 *                然后执行6个_NOP_()语句(6 μs),\
 *                最后执行了一个RET指令(2 μs)
 *          输  入：无
 *          输  出：无
 * 
 * ============================================================================
 */
void DHT11_delay10us(void)
{
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
}

/*
 * ============================================================================ 
 * 
 *          函数名: DHT11_delay_ms
 *          说  明：ms延时函数
 *          输  入：ms
 *          输  出：无
 * 
 * ============================================================================
 */
void DHT11_delay_ms(unsigned int ms)
{
    unsigned int i;
    while (ms--)
        for (i = 123; i > 0; i--)
            ;
}
